Repository: hisahi/hexbed
Catalog: po/*/hexbed.po
Languages: fi

source: &About
fi: &Tietoja

source: Displays information about this application
fi: Näyttää tietoja ohjelmasta

source: &Help
fi: &Ohje

source: &Undo
fi: &Kumoa

source: Undoes the last action
fi: Kumoaa viimeisimmän muokkauksen

source: &Redo
fi: &Tee uudelleen

source: Redoes the last undone action
fi: Suorittaa viimeksi kumotun muokkauksen uudelleen

source: Cu&t
fi: &Leikkaa

source: Copies the selection and removes it
fi: Kopioi valinnan ja poistaa sen

source: &Copy
fi: K&opioi

source: Copies the selection
fi: Kopioi valinnan

source: &Paste Insert
fi: L&iitä väliin

source: Pastes data from the clipboard and inserts it at the caret
fi: Liittää leikepöydältä tavuja ja lisää väliin kohdistimen kohdalle

source: P&aste Overwrite
fi: Liit&ä ja korvaa

source: Pastes data from the clipboard, overwriting existing data
fi: Liittää leikepöydältä tavuja kohdistimen kohdalla olevia korvaten

source: &Delete
fi: &Poista

source: Deletes the currently selected data
fi: Poistaa valitun tavualueen

source: Select &all
fi: &Valitse kaikki

source: Selects the entire file
fi: Valitsee koko tiedoston

source: Select &block...
fi: V&alitse alue...

source: Selects a block of bytes
fi: Valitsee tavualueen

source: Ins&ert or replace...
fi: Lisää tai ko&rvaa...

source: Inserts or replaces the selection with a block of bytes
fi: Lisää tai korvaa valinnan lohkolla tavuja

source: Bitwise &binary operation...
fi: &Binääribittilaskutoimitus...

source: Performs a binary bitwise operation on the selected block
fi: Muokkaa valitun alueen tavuja binaarisen laskutoimituksen perusteella

source: Bitwise &unary operation...
fi: &Unaaribittilaskutoimitus...

source: Performs a unary bitwise operation on the selected block
fi: Muokkaa valitun alueen tavuja unaarisen laskutoimituksen perusteella

source: Bitwise &shift operation...
fi: Bittisiirtolaskutoimitus...

source: Performs a bitwise shift operation on the selected block
fi: Muokkaa valitun alueen tavuja bittisiirtolaskutoimituksen perusteella

source: Byte swap (&2-byte words)
fi: Tavujärjestyksen kääntö (&2-tavuiset sanat)

source: Swaps the byte order in the selected block of 2-byte words
fi: Kääntää valittujen 2-tavuisten sanojen tavujärjestyksen

source: Byte swap (&4-byte words)
fi: Tavujärjestyksen kääntö (&4-tavuiset sanat)

source: Swaps the byte order in the selected block of 4-byte words
fi: Kääntää valittujen 4-tavuisten sanojen tavujärjestyksen

source: Byte swap (&8-byte words)
fi: Tavujärjestyksen kääntö (&8-tavuiset sanat)

source: Swaps the byte order in the selected block of 8-byte words
fi: Kääntää valittujen 8-tavuisten sanojen tavujärjestyksen

source: Byte swap (1&6-byte words)
fi: Tavujärjestyksen kääntö (1&6-tavuiset sanat)

source: Swaps the byte order in the selected block of 16-byte words
fi: Kääntää valittujen 16-tavuisten sanojen tavujärjestyksen

source: Byte s&wap
fi: Tavujärjestyksen käänt&ö

source: Performs byte order swaps on the selection
fi: Kääntää valinnan tavujärjestystä

source: &Reverse
fi: K&äännä takaperin

source: Reverses the order of bytes within the selection
fi: Kääntää koko valinnan tavujen järjestyksen

source: &Operations
fi: Laskut&oimitukset

source: Performs operations on the selection
fi: Muuttaa tavuja laskutoimituksen perusteella

source: &Insert mode
fi: &Lisäystila

source: Inserts bytes typed in instead of overwriting existing ones
fi: Lisää tavuja väliin korvaamisen sijasta

source: &Options
fi: &Asetukset

source: Opens the dialog for editing options or preferences
fi: Avaa ohjelman asetukset

source: &Edit
fi: &Muokkaa

source: &New
fi: &Uusi

source: Creates a new file
fi: Luo uuden tiedoston

source: &Open...
fi: &Avaa...

source: Opens an existing file
fi: Avaa olemassa olevan tiedoston

source: &Save
fi: &Tallenna

source: Saves the file in the current location
fi: Tallentaa tiedoston samaan sijaintiin

source: Save &As...
fi: Tallenna &nimellä...

source: Saves the file in a new location
fi: Tallentaa tiedoston uuteen sijaintiin

source: &Reload
fi: Avaa &uudelleen

source: Reload the open file and discard changes
fi: Avaa tiedoston uudelleen ja hylkää muutokset

source: &Close
fi: &Sulje

source: Closes the current file
fi: Sulkee tämänhetkisen tiedoston

source: Sa&ve all
fi: Tallenna &kaikki

source: Saves all open files
fi: Tallentaa kaikki avoimet tiedostot

source: C&lose all
fi: Sul&je kaikki

source: Closes all open files
fi: Sulkee kaikki avoimet tiedostot

source: &Import...
fi: T&uo...

source: Imports a block of bytes into a new file
fi: Tuo tavulohkon uuteen tiedostoon

source: &Export...
fi: &Vie...

source: Exports a block of bytes from the current file
fi: Vie tiedostosta tavulohkon muualle

source: E&xit
fi: &Lopeta

source: Closes the application
fi: Sulkee ohjelman

source: &File
fi: &Tiedosto

source: New
fi: Uusi

source: Open
fi: Avaa

source: Save
fi: Tallenna

source: Exit
fi: Lopeta

source: Text
fi: Teksti

source: Encoding
fi: Koodaus

source: Case insensitive
fi: Aakkoskoosta riippumaton

source: Configured character encoding (%s)
fi: Asetuksissa määritelty koodaus (%s)

source: The entered text cannot be represented in the selected encoding.
fi: Syötettyä tekstiä ei voi esittää valitulla merkistökoodauksella.

source: &Hex and text
fi: &Molemmat

source: Both columns; hex and text data
fi: Molemmat sarakkeet, sekä heksamuotoinen että tekstimuotoinen tieto

source: He&x only
fi: Vain heksa

source: Show hex column only
fi: Vain heksamuotoinen tieto

source: &Text only
fi: Vain teksti

source: Show text column only
fi: Vain tekstimuotoinen tieto

source: &Columns
fi: &Sarakkeet

source: Controls which columns to show
fi: Määrittelee näytettävät sarakkeet

source: &Bit editor
fi: &Bittimuokkain

source: Shows the bit editor
fi: Näyttää bittimuokkaimen

source: &Data inspector
fi: &Tietojenkatselin

source: Shows the data inspector
fi: Näyttää tietojenkatselimen

source: &View
fi: &Näytä

source: &Find...
fi: &Etsi...

source: Finds data and brings it into view
fi: Etsii tavuja ja tuo ne näkyville

source: Fi&nd next
fi: Et&si seuraava

source: Finds the next match with the same search
fi: Etsii seuraavan tuloksen viime haulla

source: Find &previous
fi: Etsi e&dellinen

source: Finds the previous match with the same search
fi: Etsii edellisen tuloksen viime haulla

source: &Replace...
fi: &Korvaa...

source: Finds and replaces data in the file
fi: Etsii ja korvaa pätkiä tiedostosta

source: &Go to...
fi: &Siirry...

source: Goes to a specific offset in the file
fi: Siirtyy haluttuun kohtaan tiedostoa

source: &Search
fi: &Etsi

source: Action in progress
fi: Toimintoa suoritetaan

source: Backup failed: %s
fi: Varmuuskopiointi epäonnistui: %s

source: &Retry
fi: &Uudelleen

source: &Ignore
fi: &Ohita

source: &Abort
fi: &Keskeytä

source: 'Retry' to try again, 'Ignore' to save anyway or 'Abort' to cancel.
fi: 'Uudelleen' yrittää uudelleen, 'Ohita' tallentaa joka tapauksessa ja 'Keskeytä' peruuttaa tallennuksen.

source: Retry? 'Yes' to try again, 'No' to save anyway or 'Cancel' to cancel.
fi: Yritetäänkö uudelleen? 'Ei' tallentaa silti ja 'Peruuta' peruuttaa tallennuksen.

source: [unsaved] %s
fi: [muokattu] %s

source: Save a file
fi: Tallenna tiedosto

source: All files (*.*)
fi: Kaikki tiedostot (*.*)

source: Failed to save file %s: %s
fi: Tiedoston %s tallentaminen epäonnistui: %s

source: '%s' has unsaved changes. Discard them and reload?
fi: Tiedostossa '%s' on tallentamattomia muutoksia. Hylätäänkö ne?

source: Failed to load from file %s: %s
fi: Tiedostosta %s ei voitu lukea: %s

source: &Cancel
fi: &Peruuta

source: Retry?
fi: Yritetäänkö uudelleen?

source: '%s' has unsaved changes. Do you want to save it?
fi: Tiedostossa '%s' on tallentamattomia muutoksia. Haluatko tallentaa ne?

source: [read-only] %s
fi: [vain luku] %s

source: New-%llu
fi: Uusi-%llu

source: Failed to create a new file: %s
fi: Uuden tiedoston luonti epäonnistui: %s

source: Failed to open file %s: %s
fi: Tiedoston %s avaaminen epäonnistui: %s

source: Read only
fi: Vain luku

source: No more results found for this search.
fi: Tällä haulla ei löytynyt lisää tuloksia.

source: Found and replaced %llu match.
fi: %llu esiintymä korvattiin.

source: Insert failed: %s
fi: Lisäys epäonnistui: %s

source: Bitwise binary op failed: %s
fi: Binäärilaskutoimitus epäonnistui: %s

source: Bitwise unary op failed: %s
fi: Unaarilaskutoimitus epäonnistui: %s

source: Bitwise shift op failed: %s
fi: Bittisiirtolaskutoimitus epäonnistui: %s

source: Open a file
fi: Avaa tiedosto

source: Import file
fi: Tuo tiedosto

source: Error on line %llu: %s
fi: Virhe rivillä %llu: %s

source: Failed to import: Import file was invalid. %s
fi: Tuonti epäonnistui: Tuotu tiedosto on virheellinen. %s

source: Failed to import: %s
fi: Tuonti epäonnistui: %s

source: Export file
fi: Vie tiedosto

source: Failed to export: %s
fi: Vienti epäonnistui: %s

source: Failed to copy: %s
fi: Kopiointi epäonnistui: %s

source: Failed to open the clipboard
fi: Leikepöydän avaaminen epäonnistui

source: Cannot paste the current clipboard contents, because it contains characters that the currently selected character encoding cannot represent.
fi: Nykyistä leikepöydän sisältöä ei voi liittää, koska siinä on merkkejä, joita valittu merkistökoodaus ei tue.

source: Cannot paste the current clipboard contents, because it does not contain valid hexadecimal data. Text data should be a string of hexadecimal bytes.
fi: Nykyistä leikepöydän sisältöä ei voi liittää, koska siinä ei ole kelvollista heksadesimaalimuotoista tietoa. Tekstin tulisi olla heksadesimaalisia tavuja.

source: Failed to paste: %s
fi: Liittäminen epäonnistui: %s

source: A hex editor.
fi: Tavumuokkain.

source: Bit editor
fi: Bittimuokkain

source: Enter data
fi: Syötä arvo

source: The given input is invalid for this data type.
fi: Syöte ei kelpaa valitulle tietotyypille.

source: Data inspector
fi: Tietojenkatselin

source: Little endian
fi: Nouseva tavujärjestys

source: Type
fi: Tyyppi

source: Value
fi: Arvo

source: Go to
fi: Siirry

source: From
fi: Laskettuna

source: Start
fi: Alusta

source: Cursor
fi: Kohdistimesta

source: End
fi: Lopusta

source: Offset:
fi: Osoite:

source: Radix
fi: Kantaluku

source: Oct
fi: Oktaali

source: Dec
fi: Desimaali

source: Hex
fi: Heksa

source: Select block
fi: Valitse alue

source: Length:
fi: Pituus:

source: End:
fi: Loppu:

source: Start:
fi: Alku:

source: Hex data
fi: Heksatieto

source: Data value
fi: Tietoarvo

source: Find
fi: Etsi

source: Find &next
fi: Etsi &seuraava

source: Find data
fi: Haku

source: &Wrap around
fi: Kul&je tiedosto ympäri

source: Replace
fi: Korvaa

source: N&ext
fi: S&euraava

source: Pre&vious
fi: Ede&llinen

source: &All
fi: Ka&ikki

source: Replace and find
fi: Korvaa ja hae

source: &Wrap around (find only)
fi: Kul&je tiedosto ympäri (etsittäessä)

source: Find and replace
fi: Etsi ja korvaa

source: Insert or replace
fi: Lisää tai korvaa

source: Number of bytes:
fi: Tavujen lukumäärä:

source: The bytes below will form a repeating pattern.
fi: Alla olevia tavuja toistetaan tarvittaessa.

source: Binary bitwise operation
fi: Binääribittilaskutoimitus

source: Sum
fi: Yhteenlasku

source: AND
fi: JA

source: OR
fi: TAI

source: XOR
fi: Poissulkeva TAI (XOR)

source: Operation:
fi: Laskutoimitus:

source: Bitwise shift operation
fi: Bittisiirtolaskutoimitus

source: Shift left
fi: Siirto vasemmalle

source: Shift right
fi: Siirto oikealle

source: Shift right (arithmetic)
fi: Aritmeettinen siirto oikealle

source: Rotate left
fi: Kierto vasemmalle

source: Rotate right
fi: Kierto oikealle

source: Shift count:
fi: Siirtomäärä:

source: Bitwise unary operation
fi: Unaaribittilaskutoimitus

source: NOT
fi: EI

source: Swap nibbles
fi: Puolitavujen vaihto

source: Reverse bit order
fi: Bittijärjestyksen vaihto

source: Appearance
fi: Ulkoasu

source: Font
fi: Kirjasin

source: Hex view font
fi: Päänäkymän kirjasin

source: Colors
fi: Värit

source: Background
fi: Tausta

source: Offset labels
fi: Osoitetekstit

source: Hex data, odd columns
fi: Tavut, parittomat sarakkeet

source: Hex data, even columns
fi: Tavut, parilliset sarakkeet

source: Text, printable
fi: Teksti (tulostettava)

source: Text, non-printable
fi: Teksti (ei tulostettava)

source: Selection background
fi: Valitun alueen tausta

source: Selection foreground
fi: Valitun alueen edusta

source: Secondary selection background
fi: Valitun alueen toinen tausta

source: Secondary selection foreground
fi: Valitun alueen toinen edusta

source: Alignment hint
fi: Apukohdistin

source: Using a non-monospace font is not recommended.
fi: Vaihtuvalevyisen kirjasimen käyttöä ei suositella.

source: Layout
fi: Asettelu

source: Display
fi: Näyttö

source: Use uppercase hex characters (A-F)
fi: Käytä isoja kirjaimia heksadesimaaleissa (A-F)

source: Fit as many columns as possible
fi: Mahduta mahdollisimman monta saraketta

source: Number of columns
fi: Sarakkeiden lukumäärä

source: Group size
fi: Ryhmitys

source: 1 (byte)
fi: 1 (tavu)

source: 2 (word)
fi: 2 (sana)

source: 4 (dword)
fi: 4 (kaksoissana)

source: 8 (qword)
fi: 8 (neloissana)

source: 16 (oword)
fi: 16 (kahdeksoissana)

source: Offset radix
fi: Osoitteiden kantaluku

source: 8 (octal)
fi: 8 (oktaali)

source: 10 (decimal)
fi: 10 (desimaali)

source: 16 (hex)
fi: 16 (heksadesimaali)

source: Text encoding
fi: Tekstin merkistö

source: Undo
fi: Kumoaminen

source: Note that the undo history may be shorter, as older undo history will be dropped in case of insufficient memory.
fi: Kumoamishistoria saattaa olla lyhyempikin, sillä ohjelma hylkää vanhempaa kumoamishistoriaa muistin ehtyessä.

source: Maximum length of undo history
fi: Kumoamishistorian enimmäispituus

source: Backup
fi: Varmuuskopiointi

source: Back up files (.bak) before overwriting
fi: Luo varmuuskopio (.bak) ennen korvaamista

source: Unicode, UTF-16LE (little-endian)
fi: Unicode, UTF-16LE (nouseva tavujärjestys)

source: Unicode, UTF-16BE (big-endian)
fi: Unicode, UTF-16BE (laskeva tavujärjestys)

source: Unicode, UTF-32LE (little-endian)
fi: Unicode, UTF-32LE (nouseva tavujärjestys)

source: Unicode, UTF-32BE (big-endian)
fi: Unicode, UTF-32BE (laskeva tavujärjestys)

source: Options
fi: Asetukset

source: One or more of the settings you have specified is invalid. Please check your settings and try again.
fi: Jokin määrittelemistäsi asetuksista on väärin. Tarkista asetuksesi ja yritä uudelleen.

source: The entered value cannot be represented with the specified data type.
fi: Syöttämääsi arvoa ei voi esittää valitulla tietotyypillä.

source: Insert
fi: Lisää

source: Overwrite
fi: Korvaa

source: Offset: %s
fi: Osoite: %s

source: Block: %s
fi: Lohko: %s

source: Length: %s
fi: Pituus: %s

source: uint8 (unsigned 8-bit integer)
fi: uint8 (etumerkitön 8-bittinen kokonaisluku)

source: int8 (signed 8-bit integer)
fi: int8 (etumerkillinen 8-bittinen kokonaisluku)

source: uint16 (unsigned 16-bit integer)
fi: uint16 (etumerkitön 16-bittinen kokonaisluku)

source: uint32 (unsigned 32-bit integer)
fi: uint32 (etumerkitön 32-bittinen kokonaisluku)

source: uint64 (unsigned 64-bit integer)
fi: uint64 (etumerkitön 64-bittinen kokonaisluku)

source: int16 (signed 16-bit integer)
fi: int16 (etumerkillinen 16-bittinen kokonaisluku)

source: int32 (signed 32-bit integer)
fi: int32 (etumerkillinen 32-bittinen kokonaisluku)

source: int64 (signed 64-bit integer)
fi: int64 (etumerkillinen 64-bittinen kokonaisluku)

source: float (IEEE 754 binary32 single-precision floating-point)
fi: float (IEEE 754 binary32, liukuluku perustarkkuudella)

source: double (IEEE 754 binary64 double-precision floating-point)
fi: double (IEEE 754 binary64, liukuluku kaksoistarkkuudella

source: Hexadecimal float (IEEE 754 binary32 single-precision floating-point)
fi: Heksadesimaalinen float (IEEE 754 binary32, liukuluku perustarkkuudella

source: Hexadecimal double (IEEE 754 binary64 double-precision floating-point)
fi: Heksadesimaalinen double (IEEE 754 binary64, liukuluku kaksoistarkkuudella

source: Bytes per row
fi: Tavuja rivillä

source: Mode
fi: Tila

source: Offset base
fi: Osoitteiden alku

source: Zero
fi: Nolla

source: Selection (%s)
fi: Valittu (%s)

source: Custom:
fi: Mukautettu:

source: The exported offset would be out of range for the given amount of data. Decrease the offset, try another mode or select less data to export.
fi: Valittu lohko menisi osoitealueen yli. Laske alkuosoitetta, vaihda toiseen tilaan tai valitse lyhyempi tavualue vietäväksi.

source: Intel HEX file (*.hex, *.h86)
fi: Intel HEX -tiedosto (*.hex, *.h86)

source: The exported section is 4 GiB (2^32 bytes) or longer, which is too long for Intel HEX files.
fi: Vietävä alue on 4 GiB (2^32 tavua) tai suurempi ja ylittää Intel HEX -tiedostojen enimmäiskokorajan.

source: S19 (16-bit)
fi: S19 (16-bittinen)

source: S28 (24-bit)
fi: S28 (24-bittinen)

source: S37 (32-bit)
fi: S37 (32-bittinen)

source: Motorola S-record file (*.s19, *.s28, *.s37)
fi: Motorola S-record-tiedosto (*.s19, *.s28, *.s37)

source: The exported section is 4 GiB (2^32 bytes) or longer, which is too long for Motorola S-record files.
fi: Vietävä alue on 4 GiB (2^32 tavua) tai suurempi ja ylittää Motorola S-record -tiedostojen enimmäiskokorajan.

source: C source code
fi: C-lähdekoodi

source: signed assumes two's complement.
fi: Kahden komplementti oletetaan etumerkissä.

source: Signed
fi: Etumerkillinen

source: Determine width by
fi: Leveyden määrittää

source: Bytes per line
fi: Tavuja rivillä

source: Columns per line
fi: Sarakemäärä

source: Indentation
fi: Sisennys

source: Use tab instead of spaces
fi: Sarkainmerkki välilyöntien sijasta

source: Spaces to indent/per tab
fi: Sisennys/sarkainvälilyönnit

source: Format
fi: Muoto

source: Encode bytes as hex
fi: Tavut heksadesimaalimuodossa

source: Use C99 stdint type instead of char
fi: C99:n stdint-tyypit charin sijasta

source: static (internal linkage)
fi: static (sisäinen liitosalue)

source: There are not enough columns for the current settings to fit a single byte on a line. Increase the number of columns or switch to using bytes per line instead.
fi: Määritellylle määrälle sarakkeita ei mahtuisi yhtäkään tavua riville. Kasvata sarakkeiden määrää tai vaihda tilaan, jossa tavuja on rivillä aina sama määrä.

source: The variable name may not be empty.
fi: Muuttujan nimi ei voi olla tyhjä.

source: The current variable name contains characters that the system is unable to presently convert into a multibyte string. Please change the name so that it only uses ASCII characters.
fi: Syötetyssä muuttujanimessä on merkkejä, jota järjestelmä ei tällä hetkellä osaa muuntaa monitavuiseksi merkkijonoksi. Muuta nimeä käyttämään vain ASCII-merkkejä.

source: C source code file (*.c)
fi: C-lähdekooditiedosto (*.c)

source: Java source code
fi: Java-lähdekooditiedosto

source: Variable indent
fi: Muuttujan sisennys

source: There are not enough columns for the current settings to fit a single byte on a line. Increase the number of columns, decrease the variable indent level or switch to using bytes per line instead.
fi: Määritellylle määrälle sarakkeita ei mahtuisi yhtäkään tavua riville. Kasvata sarakkeiden määrää, laske muuttujan sisennystä tai vaihda tilaan, jossa tavuja on rivillä aina sama määrä.

source: Java source code file (*.java)
fi: Java-lähdekooditiedosto (*.java)

source: C# source code
fi: C#-lähdekooditiedosto

source: C# source code file (*.cs)
fi: C#-lähdekooditiedosto (*.cs)

source: Column count
fi: Sarakemäärä

source: From editor (%s)
fi: Muokkaimesta (%s)

source: Custom
fi: Mukautettu

source: Text file (*.txt)
fi: Tekstitiedosto (*.txt)

source: HTML file (*.html, *.htm)
fi: HTML-tiedosto (*.html, *.htm)

source: Verify checksums
fi: Tarkistussummien tarkistus

source: Unexpected end-of-file while reading line.
fi: Tiedosto loppui kesken rivin lukemisen.

source: Invalid character while reading line; expected hex digit.
fi: Virheellinen merkki riviä lukiessa, heksadesimaalinumero vaaditaan.

source: Checksum error.
fi: Tarkistussumma ei täsmää.

source: Unrecognized record type.
fi: Tietueen tyyppiä ei tunnistettu.

source: Invalid record type.
fi: Virheellinen tietueen tyyppi.
